server/app/controllers/links_controller.rb

INSERT INTO "links" ("original_url", "short_url", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["original_url", "https://www.google.com"], ["short_url", "MEV62W"], ["created_at", "2025-02-25 14:23:54.924662"], ["updated_at", "2025-02-25 14:23:54.924662"]]
---
  def create
    @link = Link.new(link_params)
    if @link.save

SELECT "links".* FROM "links" ORDER BY "links"."created_at" DESC
---
  def index
    links = Link.all.order(created_at: :desc)

    render json: links.map { |link|

SELECT "links".* FROM "links" WHERE "links"."short_url" = ? LIMIT ?  [["short_url", "4x6qUM"], ["LIMIT", 1]]
---
  def find_link
    @link = Link.find_by!(short_url: params[:id])