server/app/models/link.rb

  def generate_unique_short_url
    loop do
      self.short_url = SecureRandom.alphanumeric(6)
      break unless Link.exists?(short_url: short_url)
---
SELECT 1 AS one FROM "links" WHERE "links"."short_url" = ? LIMIT ?  [["short_url", "MEV62W"], ["LIMIT", 1]]